app/controllers/myclicks_controller.rb

 def index
  @myclick = Myclick.all
---
SELECT "myclicks".* FROM "myclicks"

 def create
  	@myclick = Myclick.new(myclick_params)
 if @myclick.save
---
INSERT INTO "myclicks" ("name", "attachment", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Memory"], ["attachment", "ytr7.jpg"], ["created_at", "2019-06-27 05:49:24.504381"], ["updated_at", "2019-06-27 05:49:24.504381"]]

 def destroy
 	@myclick = Myclick.find(params[:id])
 	@myclick.destroy
---
SELECT  "myclicks".* FROM "myclicks" WHERE "myclicks"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "myclicks" WHERE "myclicks"."id" = ?  [["id", 10]]